app/Controllers/BillController.php

SELECT `p`.`name`, `b`.`price`, `b`.`qty`, `b`.`amount`
FROM `bill_items` `b`
JOIN `products` `p` ON `p`.`id` = `b`.`product_id`
WHERE `b`.`bill_id` = '1'
---
    public function view()
    {
        if ($this->request->isAJAX()) {

            $billId = $this->request->getGet('id');

            $db = db_connect();
            $builder = $db->table('bill_items b')
                ->select('p.name, b.price, b.qty, b.amount')
                ->join('products p', 'p.id = b.product_id')
                ->where('b.bill_id', $billId);
            $query = $builder->get();