app/Controllers/ProductController.php

    public function search(){
        if($this->request->isAJAX()){

            $search = $this->request->getGet('search');

            $db = db_connect();
            $builder = $db->table('products');
            $builder->like('name', $search);
            $builder->orLike('code', $search);
            $query = $builder->get();
---
SELECT *
FROM `products`
WHERE `name` LIKE '%tes%' ESCAPE '!'
OR  `code` LIKE '%tes%' ESCAPE '!'

    public function generateBill(){
        if($this->request->isAJAX()){

            $validation = [
                'name' => ['rules' => 'required|min_length[3]|max_length[50]'],
                'phone' => ['rules' => 'required|exact_length[10]|is_natural']
            ];

            if(! $this->validate($validation)){
                return response()->setJSON([
                    'token' => csrf_hash(),
                    'errors' => $this->validator->getErrors()
                ]);
            }else{

                $product = new Product();

                $productId = $this->request->getPost('product_id');
                $qty = $this->request->getPost('qty');
                $billTotal = [];

                for($i=0; $i<count($productId); $i++){

                    $productDetails = $product->asObject()->find($productId[$i]);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '1'

                    'phone' => $this->request->getPost('phone'),
                    'total_amount' => array_sum($billTotal)
                ];
                $billId = $bill->insert($billData);
---
INSERT INTO `bills` (`name`, `phone`, `total_amount`) VALUES ('jithin', '9744649344', 25)

                        array_push($billItems, $item);
                    }
                    $billItem = new BillItems();
                    $billItem->insertBatch($billItems);
---
INSERT INTO `bill_items` (`amount`, `bill_id`, `price`, `product_id`, `qty`)
VALUES (20,2,'20.00','1','1'), (5,2,'5.00','2','1')